Server/kennel/monitor/sip/soap1/soap/cwmp.ValueChange.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="urn:dslforum-org:cwmp-1-1">
 <SOAP-ENV:Body>
   <ns1:ValueChange>
    <DeviceId>
     <Manufacturer></Manufacturer>
     <OUI></OUI>
     <ProductClass></ProductClass>
     <SerialNumber></SerialNumber>
    </DeviceId>
    <MaxEnvelopes>0</MaxEnvelopes>
    <Ip></Ip>
    <CurrentTime></CurrentTime>
    <RetryCount>0</RetryCount>
    <ParameterList SOAP-ENC:arrayType="ns1:ParameterValueStruct[1]">
     <ParameterValueStruct>
      <Name></Name>
      <Value></Value>
     </ParameterValueStruct>
    </ParameterList>
   </ns1:ValueChange>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
